<!-- - Дано натуральное число n. Выведите все числа от 1 до n.-->

(function (n){
    for (let i = 1; i < n; i++) {
        console.log(i);
    }
}());


<!-- - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.-->

const foo = (a, b) => {
    if (a < b) {
        for (a; a <= b; a++) {
            console.log(a);
        }
    } else {
        for (a; a >= b; a--) {
            console.log(a);
        }
    }
};

foo();


// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

const change = (arr, i) => {
    const a = arr[i];
    arr[i] = arr[i + 1];
    arr[i + 1] = a;
    return arr;
};

console.log(change([9,8,0,4], 0));


// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]

const move = (arr) => {
    const arr1 = [];
    let j = 0;
    for (let i = 0; i < arr.length; i++) {
        if (arr[i]) {
            arr1[j] = arr[i];
            j++;
        }
    }
    for (let i = 0; i < arr.length - j; i++) {
        arr1[arr1.length] = 0;
    }

    return arr1;
};

console.log(move([1,0,6,0,3]));
