<!-- - створити функцію яка обчислює та повертає площу прямокутника висотою-->

const rectangle = (a, b) => a * b;

// =================================
<!-- - створити функцію яка обчислює та повертає площу кола-->

const circle = r => Math.PI * r**2;

// =================================
<!-- - створити функцію яка обчислює та повертає площу циліндру-->

const cylinder = (r, h) => (Math.PI * r**2) * h;

// =================================
<!-- - створити функцію яка приймає масив та виводить кожен його елемент-->

(function (arr) {
    for (const item of arr) {
        console.log(item);
    }
}([]));

// =================================
<!-- - створити функцію яка створює параграф з текстом. Текст задати через аргумент-->

const parag = p => document.write(`<p>${p}</p>`);

// =================================
<!-- - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий-->

(function (text) {
    document.write('<ul>');
    document.write(`<li>${text}</li>`);
    document.write(`<li>${text}</li>`);
    document.write(`<li>${text}</li>`);
    document.write('</ul>');
}('text'));

// =================================
<!-- - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)-->

(function (text, num) {
    document.write('<ul>');
    for (let i = 0; i < num; i++) {
        document.write(`<li>${text}</li>`);
    }
    document.write('</ul>');
}('text', 5));

// =================================
<!-- - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список-->

const list3 = (arr) => {
    document.write('<ul>');
    for (const item of arr) {
        document.write(`<li>${item}</li>`);
    }
    document.write('</ul>');
};

// =================================
<!-- - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.-->

const foo = (arr) => {
    for (const item of arr) {
        document.write(`<div>${item.id} ${item.name} ${item.age}`);
    }
};